; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=4, waypoints=9, cameras=4, objectives=8, out_folder=training/easy, instance_id=81, seed=116

(define (problem rover-81)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 - objective)
 (:init 
    (at_lander general waypoint9)
    (at rover1 waypoint5)
    (at rover2 waypoint1)
    (at rover3 waypoint2)
    (at rover4 waypoint3)
    (equipped_for_soil_analysis rover3)
    (equipped_for_soil_analysis rover1)
    (equipped_for_soil_analysis rover2)
    (equipped_for_rock_analysis rover3)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint6)
    (at_rock_sample waypoint8)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint3)
    (at_soil_sample waypoint8)
    (visible waypoint2 waypoint4)
    (visible waypoint9 waypoint3)
    (visible waypoint4 waypoint9)
    (visible waypoint3 waypoint7)
    (visible waypoint6 waypoint1)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint7 waypoint3)
    (visible waypoint9 waypoint5)
    (visible waypoint8 waypoint9)
    (visible waypoint3 waypoint9)
    (visible waypoint9 waypoint8)
    (visible waypoint5 waypoint9)
    (visible waypoint1 waypoint6)
    (visible waypoint9 waypoint4)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint1 waypoint9)
    (visible waypoint9 waypoint1)
    (visible waypoint3 waypoint5)
    (visible waypoint5 waypoint3)
    (visible waypoint3 waypoint8)
    (visible waypoint8 waypoint3)
    (visible waypoint4 waypoint5)
    (visible waypoint5 waypoint4)
    (can_traverse rover1 waypoint2 waypoint4)
    (can_traverse rover1 waypoint9 waypoint3)
    (can_traverse rover1 waypoint4 waypoint9)
    (can_traverse rover1 waypoint3 waypoint7)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint4 waypoint2)
    (can_traverse rover1 waypoint7 waypoint3)
    (can_traverse rover1 waypoint9 waypoint5)
    (can_traverse rover1 waypoint8 waypoint9)
    (can_traverse rover1 waypoint3 waypoint9)
    (can_traverse rover1 waypoint9 waypoint8)
    (can_traverse rover1 waypoint5 waypoint9)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint9 waypoint4)
    (can_traverse rover2 waypoint2 waypoint4)
    (can_traverse rover2 waypoint9 waypoint3)
    (can_traverse rover2 waypoint4 waypoint9)
    (can_traverse rover2 waypoint3 waypoint7)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover2 waypoint4 waypoint2)
    (can_traverse rover2 waypoint7 waypoint3)
    (can_traverse rover2 waypoint9 waypoint5)
    (can_traverse rover2 waypoint8 waypoint9)
    (can_traverse rover2 waypoint3 waypoint9)
    (can_traverse rover2 waypoint9 waypoint8)
    (can_traverse rover2 waypoint5 waypoint9)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint9 waypoint4)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint9 waypoint3)
    (can_traverse rover3 waypoint4 waypoint9)
    (can_traverse rover3 waypoint3 waypoint7)
    (can_traverse rover3 waypoint6 waypoint1)
    (can_traverse rover3 waypoint4 waypoint6)
    (can_traverse rover3 waypoint6 waypoint4)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover3 waypoint7 waypoint3)
    (can_traverse rover3 waypoint9 waypoint5)
    (can_traverse rover3 waypoint8 waypoint9)
    (can_traverse rover3 waypoint3 waypoint9)
    (can_traverse rover3 waypoint9 waypoint8)
    (can_traverse rover3 waypoint5 waypoint9)
    (can_traverse rover3 waypoint1 waypoint6)
    (can_traverse rover3 waypoint9 waypoint4)
    (can_traverse rover3 waypoint1 waypoint9)
    (can_traverse rover3 waypoint9 waypoint1)
    (can_traverse rover3 waypoint3 waypoint5)
    (can_traverse rover3 waypoint5 waypoint3)
    (can_traverse rover4 waypoint2 waypoint4)
    (can_traverse rover4 waypoint9 waypoint3)
    (can_traverse rover4 waypoint4 waypoint9)
    (can_traverse rover4 waypoint3 waypoint7)
    (can_traverse rover4 waypoint6 waypoint1)
    (can_traverse rover4 waypoint4 waypoint6)
    (can_traverse rover4 waypoint6 waypoint4)
    (can_traverse rover4 waypoint4 waypoint2)
    (can_traverse rover4 waypoint7 waypoint3)
    (can_traverse rover4 waypoint9 waypoint5)
    (can_traverse rover4 waypoint8 waypoint9)
    (can_traverse rover4 waypoint3 waypoint9)
    (can_traverse rover4 waypoint9 waypoint8)
    (can_traverse rover4 waypoint5 waypoint9)
    (can_traverse rover4 waypoint1 waypoint6)
    (can_traverse rover4 waypoint9 waypoint4)
    (can_traverse rover4 waypoint3 waypoint8)
    (can_traverse rover4 waypoint8 waypoint3)
    (calibration_target camera1 objective8)
    (on_board camera1 rover1)
    (supports camera1 colour)
    (calibration_target camera2 objective3)
    (on_board camera2 rover1)
    (supports camera2 colour)
    (calibration_target camera3 objective2)
    (on_board camera3 rover3)
    (supports camera3 high_res)
    (calibration_target camera4 objective6)
    (on_board camera4 rover2)
    (supports camera4 high_res)
    (supports camera4 colour)
    (supports camera4 low_res)
    (supports camera2 low_res)
    (supports camera1 low_res)
    (supports camera3 low_res)
    (visible_from objective1 waypoint4)
    (visible_from objective1 waypoint6)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint2)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint8)
    (visible_from objective1 waypoint9)
    (visible_from objective2 waypoint6)
    (visible_from objective2 waypoint5)
    (visible_from objective2 waypoint1)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint9)
    (visible_from objective2 waypoint2)
    (visible_from objective2 waypoint8)
    (visible_from objective3 waypoint6)
    (visible_from objective4 waypoint3)
    (visible_from objective4 waypoint1)
    (visible_from objective4 waypoint8)
    (visible_from objective4 waypoint6)
    (visible_from objective5 waypoint6)
    (visible_from objective5 waypoint4)
    (visible_from objective5 waypoint5)
    (visible_from objective5 waypoint7)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint9)
    (visible_from objective5 waypoint1)
    (visible_from objective5 waypoint3)
    (visible_from objective6 waypoint4)
    (visible_from objective6 waypoint1)
    (visible_from objective7 waypoint3)
    (visible_from objective7 waypoint1)
    (visible_from objective7 waypoint8)
    (visible_from objective7 waypoint9)
    (visible_from objective7 waypoint6)
    (visible_from objective7 waypoint2)
    (visible_from objective8 waypoint8))
 (:goal  (and 
    
    (communicated_soil_data waypoint1)
    (communicated_soil_data waypoint3)
    (communicated_soil_data waypoint8)
    (communicated_image_data objective6 low_res)
    (communicated_image_data objective5 low_res)
    (communicated_image_data objective7 high_res)
    (communicated_image_data objective8 colour)
    (communicated_image_data objective4 low_res)
    (communicated_image_data objective4 high_res))))

; plan
1. (navigate rover1 waypoint5 waypoint9)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint9)
   goals met: 0 of 9
2. (navigate rover1 waypoint9 waypoint8)
   deleted: (at rover1 waypoint9)
   added: (at rover1 waypoint8)
   goals met: 0 of 9
3. (calibrate rover1 camera1 objective8 waypoint8)
   added: (calibrated camera1 rover1)
   goals met: 0 of 9
4. (sample_soil rover1 rover1store waypoint8)
   deleted: (empty rover1store) (at_soil_sample waypoint8)
   added: (full rover1store) (have_soil_analysis rover1 waypoint8)
   goals met: 0 of 9
5. (communicate_soil_data rover1 general waypoint8 waypoint8 waypoint9)
   added: (communicated_soil_data waypoint8)
   goals met: 1 of 9
6. (take_image rover1 waypoint8 objective8 camera1 colour)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective8 colour)
   goals met: 1 of 9
7. (communicate_image_data rover1 general objective8 colour waypoint8 waypoint9)
   added: (communicated_image_data objective8 colour)
   goals met: 2 of 9
8. (sample_soil rover2 rover2store waypoint1)
   deleted: (empty rover2store) (at_soil_sample waypoint1)
   added: (full rover2store) (have_soil_analysis rover2 waypoint1)
   goals met: 2 of 9
9. (communicate_soil_data rover2 general waypoint1 waypoint1 waypoint9)
   added: (communicated_soil_data waypoint1)
   goals met: 3 of 9
10. (calibrate rover2 camera4 objective6 waypoint1)
   added: (calibrated camera4 rover2)
   goals met: 3 of 9
11. (take_image rover2 waypoint1 objective4 camera4 high_res)
   deleted: (calibrated camera4 rover2)
   added: (have_image rover2 objective4 high_res)
   goals met: 3 of 9
12. (communicate_image_data rover2 general objective4 high_res waypoint1 waypoint9)
   added: (communicated_image_data objective4 high_res)
   goals met: 4 of 9
13. (calibrate rover2 camera4 objective6 waypoint1)
   added: (calibrated camera4 rover2)
   goals met: 4 of 9
14. (take_image rover2 waypoint1 objective7 camera4 high_res)
   deleted: (calibrated camera4 rover2)
   added: (have_image rover2 objective7 high_res)
   goals met: 4 of 9
15. (communicate_image_data rover2 general objective7 high_res waypoint1 waypoint9)
   added: (communicated_image_data objective7 high_res)
   goals met: 5 of 9
16. (navigate rover1 waypoint8 waypoint9)
   deleted: (at rover1 waypoint8)
   added: (at rover1 waypoint9)
   goals met: 5 of 9
17. (navigate rover1 waypoint9 waypoint3)
   deleted: (at rover1 waypoint9)
   added: (at rover1 waypoint3)
   goals met: 5 of 9
18. (calibrate rover2 camera4 objective6 waypoint1)
   added: (calibrated camera4 rover2)
   goals met: 5 of 9
19. (take_image rover2 waypoint1 objective4 camera4 low_res)
   deleted: (calibrated camera4 rover2)
   added: (have_image rover2 objective4 low_res)
   goals met: 5 of 9
20. (communicate_image_data rover2 general objective4 low_res waypoint1 waypoint9)
   added: (communicated_image_data objective4 low_res)
   goals met: 6 of 9
21. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 6 of 9
22. (sample_soil rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_soil_sample waypoint3)
   added: (full rover1store) (have_soil_analysis rover1 waypoint3)
   goals met: 6 of 9
23. (communicate_soil_data rover1 general waypoint3 waypoint3 waypoint9)
   added: (communicated_soil_data waypoint3)
   goals met: 7 of 9
24. (calibrate rover2 camera4 objective6 waypoint1)
   added: (calibrated camera4 rover2)
   goals met: 7 of 9
25. (take_image rover2 waypoint1 objective6 camera4 low_res)
   deleted: (calibrated camera4 rover2)
   added: (have_image rover2 objective6 low_res)
   goals met: 7 of 9
26. (communicate_image_data rover2 general objective6 low_res waypoint1 waypoint9)
   added: (communicated_image_data objective6 low_res)
   goals met: 8 of 9
27. (calibrate rover2 camera4 objective6 waypoint1)
   added: (calibrated camera4 rover2)
   goals met: 8 of 9
28. (take_image rover2 waypoint1 objective5 camera4 low_res)
   deleted: (calibrated camera4 rover2)
   added: (have_image rover2 objective5 low_res)
   goals met: 8 of 9
29. (communicate_image_data rover2 general objective5 low_res waypoint1 waypoint9)
   added: (communicated_image_data objective5 low_res)
   goals met: 9 of 9
